src/main/resources/requests/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://alex.ru/soapdemo/DTO">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequest>
            <gs:username>Дмитрий</gs:username>
        </gs:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>